| 编辑命令           |            |            |            |
| 文体目标           | 修改       | 删除       | 复制       |
|--------------------+------------+------------+------------|
| 1 个单词           | cw         | dw         | yw         |
| 2 个单词，不计标点 | 2cw 或 c2w | 2dw 或 d2w | 2yw 或 y2w |
| 向后 3 个单词      | 3db 或 c3b | 3dw 或 d3w | 3yb 或 y3b |
| 1 行               | cc         | dd         | yy 或 Y    |
| 到行尾             | c$         | d$或 D     | y$         |
| 到行首             | c0         | d0         | y0         |
| 单个字符           | r          | x 或 X     | yi 或 yh   |
| 5 个字符           | 5s         | 5x         | 5yl        |
|--------------------+------------+------------+------------|
** DONE <2016-07-22 Fri 06:53> learn vim eidt
   CLOSED: [2016-07-22 Fri 07:14]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2016-07-22 Fri 07:14]
   CLOCK: [2016-07-22 Fri 06:53]--[2016-07-22 Fri 07:14] =>  0:21
   :END:
 移动
 | 四个箭头（左下上右） | h j k l |
 |----------------------+---------|
 | 到下一行的首字符     | +       |
 | 到上一行的首字符     | -       |
 | 到单词的尾部         | e或E    |
 | 按单词前移           | w或W    |
 | 按单词后移           | b或B    |
 | 到行尾               | $       |
 | 到行首               | 0       |
 |----------------------+---------|

 其它操作

 |--------------------------------------+---------|
 | 从缓冲区输出文本                     | p或P    |
 | 启动vi，如果指定了文件，就打开该文件 | vi file |
 | 保存编辑、退出文件                   | ZZ      |
 | 不保存编辑、退出文件                 | :q!     |
 |--------------------------------------+---------|

 文本创建和操作命令
 | 在当前位置插入文本                         | i        |
 |--------------------------------------------+----------|
 | 在行首手插入文本                           | I        |
 | 在当前位置追加文本                         | a        |
 | 在行尾追加文本                             | A        |
 | 在光标所在行的下面新建一行，等待输入新文本 | o        |
 | 在光标所在行的上面新建一行，等待输入新文本 | O        |
 | 删除行并替换文本                           | S        |
 | 使用输入的文本替换光标所在位置的字符       | s        |
 | 使用新文本覆盖现有文本                     | R        |
 | 合并当前行和下一行                         | J(大写） |
 | 转换大小写                                 | ~        |
 | 重复上次操作                               | .        |
 | 取消上次修改                               | u        |
 | 恢复行到初始状态                           | U        |
 |--------------------------------------------+----------|

** DONE 练习一遍
   CLOSED: [2016-07-22 Fri 20:43]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2016-07-22 Fri 20:43]
   CLOCK: [2016-07-22 Fri 20:25]--[2016-07-22 Fri 20:43] =>  0:18
   :END:
** DONE 学习查找替换
   CLOSED: [2016-07-23 Sat 16:59]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2016-07-23 Sat 16:59]
   CLOCK: [2016-07-23 Sat 16:45]--[2016-07-23 Sat 16:59] =>  0:14
   :END:
:s/old/new/g
Is a woman in a blue cap cheeful? No, a woman in a blue cap is sad.
